[
  {
    "command": "nmap -sV 192.168.56.11",
    "matches": [
      "I want to detect service versions running on open ports",
      "I want to identify which software and versions are exposed"
    ],
    "flags_and_protocol": "-sV enables service and version detection. After discovering open ports, Nmap sends protocol-specific probes and analyzes responses to determine the service type and version.",
    "red_team": "Useful for identifying exact software versions to map against known vulnerabilities (e.g., outdated Apache, OpenSSH). Often combined with -sC or -A for deeper enumeration.",
    "blue_team": "Generates unusual or malformed service requests visible in application logs. IDS/IPS may detect version probing signatures. Repeated banner-grabbing behavior can indicate reconnaissance.",
    "combo": [
      "-sC for default script scan",
      "-A for OS + version + script + traceroute",
      "-p- to scan all TCP ports",
      "-T4 to increase scan speed"
    ]
  },
  {
    "command": "nmap -O 192.168.56.12",
    "matches": [
      "I want to detect the operating system of a target",
      "I want to fingerprint the OS remotely"
    ],
    "flags_and_protocol": "-O enables OS detection. Nmap sends specially crafted TCP/IP probes and compares responses against its fingerprint database.",
    "red_team": "Helps tailor exploits and payloads to the correct OS. Reduces guesswork when planning privilege escalation or lateral movement.",
    "blue_team": "Detected as abnormal TCP packets with unusual flag combinations. IDS tools can flag OS fingerprinting attempts based on known probe patterns.",
    "combo": [
      "-sV for service + OS detection",
      "--osscan-guess for more aggressive OS guessing",
      "-A for full aggressive scan",
      "-Pn if host discovery is blocked"
    ]
  },
  {
    "command": "nmap -Pn 192.168.56.13",
    "matches": [
      "I want to skip host discovery",
      "I want to scan a host that blocks ICMP"
    ],
    "flags_and_protocol": "-Pn disables host discovery and assumes the host is up. Nmap skips ICMP echo, TCP ACK, and other discovery probes and directly performs port scanning.",
    "red_team": "Useful when firewalls block ping (ICMP). Prevents false negatives where a host appears down but actually isn’t.",
    "blue_team": "Port scan activity begins without prior ICMP traffic. Monitoring systems may detect direct scanning behavior without standard discovery patterns.",
    "combo": [
      "-sS for SYN scan without host discovery",
      "-sV for version detection on assumed-up host",
      "-p- for full port scan",
      "-T4 for faster execution"
    ]
  },
  {
    "command": "nmap -sU 192.168.56.14",
    "matches": [
      "I want to scan UDP ports",
      "I want to discover open UDP services like DNS or SNMP"
    ],
    "flags_and_protocol": "-sU performs a UDP scan. Nmap sends UDP packets to target ports and interprets ICMP 'port unreachable' responses or lack of response to determine port state.",
    "red_team": "Important for discovering services like DNS (53), SNMP (161), or NTP (123) that are often overlooked. Slower and noisier than TCP scans.",
    "blue_team": "Visible as UDP probes to multiple ports. Firewalls log repeated UDP attempts and ICMP unreachable replies. High UDP sweep activity may trigger alerts.",
    "combo": [
      "-sS to scan TCP + UDP together",
      "-p 53,161,123 to target common UDP services",
      "-sV for UDP service version detection",
      "--top-ports 100 for faster UDP discovery"
    ]
  },
  {
    "command": "nmap -D RND:5 192.168.56.15",
    "matches": [
      "I want to use decoy IP addresses",
      "I want to obscure the real source of my scan"
    ],
    "flags_and_protocol": "-D specifies decoy IP addresses. RND:5 generates 5 random decoys. The target sees scan traffic appearing to originate from multiple IPs.",
    "red_team": "Adds noise to make attribution harder. Can confuse simple logging systems that do not correlate traffic patterns deeply.",
    "blue_team": "Multiple apparent sources scanning simultaneously is suspicious. Advanced monitoring can correlate timing patterns to identify the true scanning host.",
    "combo": [
      "-sS for stealth SYN scan with decoys",
      "-Pn to skip host discovery while using decoys",
      "-p- to perform a full port sweep",
      "-T4 to increase scan aggressiveness"
    ]
  },
  {
    "command": "nmap -p- -T4 192.168.56.16",
    "matches": [
      "I want to scan all ports quickly",
      "I want to increase scan speed"
    ],
    "flags_and_protocol": "-p- scans all 65535 TCP ports. -T4 increases timing aggressiveness, reducing delays between probes and speeding up the scan.",
    "red_team": "Useful during lab or internal assessments when speed matters. Higher timing can increase detection risk.",
    "blue_team": "Large volume of connection attempts across all ports in a short time window. Easily detectable by rate-based monitoring and port sweep alerts.",
    "combo": [
      "-sV to detect service versions on all ports",
      "-O for OS fingerprinting",
      "-Pn to skip host discovery",
      "-A for comprehensive aggressive scan"
    ]
  },
  {
    "command": "nmap -sn TARGETS",
    "matches": [
      "I only want host discovery without a port scan",
      "I want to quickly find which targets are up"
    ],
    "flags_and_protocol": "-sn performs host discovery only (ping scan) and skips port scanning. Nmap uses its default host discovery probes (ARP on local subnet, plus ICMP/TCP probes depending on privileges and network context).",
    "red_team": "Fast way to build an initial live-host list before deeper enumeration. Useful for reducing scan noise and focusing later scans on online systems.",
    "blue_team": "Appears as broad discovery traffic with limited follow-up ports. Defenders can detect sweeps that enumerate many hosts in a short period.",
    "combo": [
      "-PR -sn for explicit ARP discovery on local subnet",
      "-PE -sn for ICMP echo discovery",
      "-PP -sn for ICMP timestamp discovery",
      "-PM -sn for ICMP address mask discovery"
    ]
  },
  {
    "command": "nmap -PR -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts on my local subnet using ARP",
      "I need reliable host discovery on a LAN where ICMP may be filtered"
    ],
    "flags_and_protocol": "-PR tells Nmap to use ARP requests for host discovery; -sn skips port scanning. ARP is link-layer and typically very reliable for local-network live-host detection. This focuses on Nmap ARP discovery (not the separate arp-scan tool, which can provide similar ARP-based sweeps).",
    "red_team": "Excellent first step on an internal segment: ARP replies identify live neighbors even when host firewalls block ICMP echo. Great for quickly mapping a /24.",
    "blue_team": "Produces bursts of ARP who-has requests across the subnet. Network monitoring can flag unusual ARP sweep behavior as reconnaissance.",
    "combo": [
      "-sn to keep discovery-only behavior",
      "-PE -sn to compare ICMP echo results",
      "-PP -sn to test timestamp responses",
      "-PM -sn to test address mask responses"
    ]
  },
  {
    "command": "nmap -PE -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts using ICMP echo requests",
      "I want a ping sweep with Nmap"
    ],
    "flags_and_protocol": "-PE uses ICMP Echo Request (Type 8) for host discovery and expects Echo Reply (Type 0). -sn ensures Nmap does not continue with a port scan.",
    "red_team": "Useful for broad ping sweeps, but results can miss hosts behind firewalls that drop ICMP echo.",
    "blue_team": "Visible as ICMP echo sweep traffic. Many security tools detect sequential ping activity across subnets.",
    "combo": [
      "-sn for host discovery only",
      "-PR -sn for local-subnet ARP discovery",
      "-PP -sn for ICMP timestamp probes",
      "-PM -sn for ICMP address mask probes"
    ]
  },
  {
    "command": "nmap -PP -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts with ICMP timestamp requests",
      "ICMP echo is blocked and I want another ICMP host-discovery method"
    ],
    "flags_and_protocol": "-PP sends ICMP Timestamp Request (Type 13) and looks for Timestamp Reply (Type 14). With -sn, Nmap performs host discovery without port scanning.",
    "red_team": "Alternative discovery method when echo responses are filtered but timestamp replies are still permitted.",
    "blue_team": "Can look suspicious because timestamp probes are less common in normal traffic. Detection rules often treat this as reconnaissance.",
    "combo": [
      "-sn to avoid port scan phase",
      "-PE -sn for ICMP echo discovery",
      "-PM -sn for ICMP address mask discovery",
      "-PR -sn for LAN ARP discovery"
    ]
  },
  {
    "command": "nmap -PM -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts with ICMP address mask requests",
      "I want another ICMP-based host discovery option"
    ],
    "flags_and_protocol": "-PM sends ICMP Address Mask Request (Type 17) and waits for Address Mask Reply (Type 18). -sn keeps the scan in host-discovery mode only.",
    "red_team": "Niche but useful when testing multiple discovery paths to avoid false negatives from filtered ICMP echo.",
    "blue_team": "Address mask probes are uncommon and often stand out in telemetry, making them useful for early reconnaissance detection.",
    "combo": [
      "-sn for no port scan",
      "-PE -sn for echo-request discovery",
      "-PP -sn for timestamp discovery",
      "-PR -sn for reliable local ARP host discovery"
    ]
  },
  {
    "command": "nmap -PS -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts with TCP SYN ping",
      "Which TCP ping scan does not require a privileged account",
      "I want Nmap to send SYN probes for host discovery"
    ],
    "flags_and_protocol": "-PS sends TCP SYN probes (default port 80 unless you specify ports) and -sn keeps the scan in host-discovery mode only. A SYN/ACK or RST response indicates the host is up. Unprivileged users can still run SYN ping, but if the port is open they typically complete the TCP handshake.",
    "red_team": "Good when ICMP is filtered but TCP services are reachable. Can quickly identify live systems before deeper scanning.",
    "blue_team": "Shows many SYN probes across hosts, often to port 80. Detection systems can flag this as reconnaissance when probes fan out over a subnet.",
    "combo": [
      "-PS21 to probe the telnet port specifically",
      "-PS21-25 to probe a range of TCP ports",
      "-PS80,443,8080 to probe multiple common web ports",
      "-sn to avoid immediately moving into a full port scan"
    ]
  },
  {
    "command": "sudo nmap -PA -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts with TCP ACK ping",
      "Which TCP ping scan requires a privileged account",
      "I want to send ACK probes for host discovery"
    ],
    "flags_and_protocol": "-PA sends TCP ACK probes (default port 80 if omitted), and a RST response usually indicates the host is online. Running as a privileged user is recommended so Nmap can send raw ACK probes as intended.",
    "red_team": "Useful for host discovery in environments where standard ping is filtered but TCP stacks still answer unexpected ACK packets.",
    "blue_team": "Creates unusual ACK-only traffic that is not part of established sessions. This pattern is often suspicious in IDS/IPS telemetry.",
    "combo": [
      "-PA21 to probe the telnet port with ACK ping",
      "-PA21-25 for an ACK ping range",
      "-PA80,443,8080 for a multi-port ACK ping",
      "-sn to keep discovery-only behavior"
    ]
  },
  {
    "command": "sudo nmap -PU -sn MACHINE_IP/24",
    "matches": [
      "I want to discover live hosts with UDP ping",
      "I want to use UDP host discovery instead of TCP",
      "I want Nmap to trigger ICMP port unreachable replies"
    ],
    "flags_and_protocol": "-PU sends UDP probes for host discovery and -sn skips port scanning. Closed UDP ports often return ICMP destination unreachable (port unreachable), which reveals that the host is alive.",
    "red_team": "Helpful where TCP/ICMP probes are restricted. UDP-based discovery can find hosts that respond differently to closed UDP ports.",
    "blue_team": "Can generate many UDP probes to uncommon ports plus ICMP unreachable replies. This is a recognizable reconnaissance signature.",
    "combo": [
      "-PU53 for DNS-focused UDP ping",
      "-PU67,68 for DHCP-related UDP ping probes",
      "-PU161 for SNMP-oriented discovery",
      "-sn to keep it as host discovery only"
    ]
  },
  {
    "command": "nmap -n -PE -sn 10.42.0.0/24",
    "matches": [
      "I want to find live hosts with ICMP echo but avoid all reverse-DNS requests",
      "I need a fast ping sweep and do not want hostnames resolved",
      "Which command performs host discovery and keeps output in raw IP format"
    ],
    "flags_and_protocol": "-PE sends ICMP Echo Requests for host discovery. -sn keeps the scan in discovery-only mode. -n disables DNS lookups, so Nmap does not perform PTR (reverse-DNS) queries for discovered addresses.",
    "red_team": "Great for quick internal mapping when DNS logging is heavily monitored. You still identify live systems while reducing resolver-side artifacts.",
    "blue_team": "You may see ICMP sweep activity without corresponding DNS PTR lookups. Correlating probe traffic with absent resolver telemetry can flag stealthier reconnaissance.",
    "combo": [
      "-PP -sn -n for ICMP timestamp discovery without DNS",
      "-PS443 -sn -n when ICMP echo is filtered",
      "-PR -sn -n for local-subnet ARP discovery only",
      "-T4 to speed up broad lab sweeps"
    ]
  },
  {
    "command": "nmap -R -sn 172.20.14.0/24",
    "matches": [
      "I want host discovery and I also want hostnames resolved for every target",
      "I need reverse-DNS names even when some systems do not answer probes",
      "Which option forces DNS resolution for all target IPs during a ping scan"
    ],
    "flags_and_protocol": "-sn performs host discovery only. -R tells Nmap to always resolve names, including reverse-DNS lookups for target IPs that appear down, which can reveal inventory naming conventions.",
    "red_team": "Useful when hostnames help triage targets (e.g., app, backup, dc). It provides richer context before port scanning, but increases DNS visibility.",
    "blue_team": "Burst PTR-query patterns across a subnet can be high-confidence recon. DNS monitoring can catch this even if many hosts block ping probes.",
    "combo": [
      "--dns-servers 10.20.0.53,10.20.0.54 to use internal resolvers",
      "-sL -R for name resolution without active probing",
      "-n when you explicitly want to suppress all DNS resolution",
      "-PE -sn to pair forced DNS with ICMP echo discovery"
    ]
  },
  {
    "command": "nmap -sL -R --dns-servers 9.9.9.9,1.1.1.1 192.0.2.0/28",
    "matches": [
      "I want to enumerate targets and collect reverse-DNS names without sending port probes",
      "I want to test how a specific resolver pair answers PTR records for a range",
      "Which command performs a list scan while forcing reverse-DNS using chosen DNS servers"
    ],
    "flags_and_protocol": "-sL is list scan mode: it does not probe host ports and mainly enumerates targets. With -R, Nmap forces reverse-DNS lookups for each target, and --dns-servers selects the resolver IPs used for those queries.",
    "red_team": "Helpful for passive target profiling before noisy scans. You can infer business roles from names while minimizing direct interaction with endpoints.",
    "blue_team": "Even without host probes, unusual high-volume PTR lookups from one source can indicate pre-attack reconnaissance. DNS logs become the primary detection surface.",
    "combo": [
      "-sL -n to list targets without any DNS queries",
      "-sn -R to add live-host testing plus forced reverse-DNS",
      "--resolve-all with -sL for broader name-resolution attempts",
      "-v for more verbose list-scan output"
    ]
  },
  {
    "command": "masscan MACHINE_IP/24 --top-ports 100",
    "matches": [
      "I want a very fast scan like Nmap host discovery workflows",
      "I want to use masscan for aggressive network discovery",
      "I want to scan top ports quickly across a subnet"
    ],
    "flags_and_protocol": "Masscan is a high-speed asynchronous scanner. --top-ports 100 targets the most common ports and can discover reachable services rapidly; unlike standard Nmap defaults, Masscan is designed for extreme packet rates.",
    "red_team": "Great for rapid initial mapping at scale. You can quickly identify responsive hosts/services before validating results with Nmap.",
    "blue_team": "Very bursty packet behavior is easy to spot. Rate-based alerts and perimeter monitoring often catch masscan activity quickly.",
    "combo": [
      "-p443 to test a single port quickly",
      "-p80,443 for common web services",
      "-p22-25 for small range sweeps",
      "--rate 1000 to control aggressiveness"
    ]
  }
]
